/************************** БЫСТРЫЙ AnalogRead для опроса потенциометров ***********************/
void setupADC() {
  ADMUX  = (1 << REFS0);                // Референс AVcc, канал ADC0
  ADCSRA = (1 << ADEN)  |               // Включить АЦП
           (1 << ADPS2) | (1 << ADPS1); // Предделитель 64 (16MHz/64 = 250kHz)
}

uint16_t fastAnalogRead(uint8_t channel) {
  ADMUX = (ADMUX & 0xF0) | (channel & 0x0F); // Выбор канала
  ADCSRA |= (1 << ADSC);                     // Запуск преобразования
  while (ADCSRA & (1 << ADSC));              // Ждём завершения
  return ADC;                                // Возвращаем результат
}
/***********************************************************************************************/
